app/controllers/dashboard_controller.rb

   def my_account
      @user = Users.find(session[:userid])
---
SELECT * FROM `users` WHERE (`users`.`id` = 12)